Documents/ТК_КорректировкаДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ТК_КорректировкаДолга</Name>
			<Comment>Корректировка долга</Comment>
			<BasedOn>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПокупателямиПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Comment>Флаг отражения документа в регламентированном учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик/комитент от которого мы получили товар</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаПриход</Name>
					<Comment>Сумма увеличения долга контрагента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаРасход</Name>
					<Comment>Сумма уменьшения долга контрагента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДохода</Name>
					<Comment>Статья доходов по начислению задолженности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Comment>Статья расходов по списанию задолженности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
					<Comment>Состав корректируемых долгов по договорам и сделкам</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорВзаиморасчетов</Name>
							<Comment>Договор, по которому ведутся взаиморасчеты с контрагентом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Comment>Сделка, по которой корректируется долг</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипыСделок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УвеличениеДолга</Name>
							<Comment>Сумма, на которую надо увеличить долг контрагента</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УменьшениеДолга</Name>
							<Comment>Сумма, на которую надо уменьшить долг контрагента</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыСПокупателямиПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПокупателямиПоДокументам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма долга в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции взаиморасчетов (оплата, предоплата...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСПоставщикамиПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПоставщикамиПоДокументам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма долга в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции взаиморасчетов (оплата, предоплата...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ТК_КорректировкаДолга/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ





&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	МассивХозОпераций = ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("КорректировкаДолга"); 
	
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(МассивХозОпераций);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	//
	//// СтандартныеПодсистемы.Свойства
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", Элементы.ГруппаДополнительныеРеквизиты.Имя);
	//ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	//УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	//// Конец СтандартныеПодсистемы.Свойства
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.Свойства
	ВидимостьЗаполнения();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//	// СтандартныеПодсистемы.Свойства
	//	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//// СтандартныеПодсистемы.Свойства 
	//Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
	//    ОбновитьЭлементыДополнительныхРеквизитов();
	//    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	//КонецЕсли;
	//// Конец СтандартныеПодсистемы.Свойства
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	//// Конец СтандартныеПодсистемы.Свойства
	//
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);			
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	//// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры








//// СтандартныеПодсистемы.Свойства
//&НаКлиенте
//Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
//    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
//КонецПроцедуры
//// Конец СтандартныеПодсистемы.Свойства


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//// СтандартныеПодсистемы.Свойства 
//&НаСервере
//Процедура ОбновитьЭлементыДополнительныхРеквизитов()
//    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
//    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
//    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

//&НаСервере
//Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
//    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
//КонецПроцедуры

//// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура Заполнение(Кнопка, Договор = Неопределено)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РЕЗУЛЬТАТ.Расчеты КАК Расчеты,
	|	РЕЗУЛЬТАТ.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	РЕЗУЛЬТАТ.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РЕЗУЛЬТАТ.РегламентированныйУчет КАК РегламентированныйУчет,
	|	РЕЗУЛЬТАТ.Сделка КАК Сделка,
	|	РЕЗУЛЬТАТ.УменьшениеДолга КАК УменьшениеДолга,
	|	РЕЗУЛЬТАТ.УвеличениеДолга КАК УвеличениеДолга
	|ИЗ
	|	(ВЫБРАТЬ
	|		""РасчетыСПокупателями"" КАК Расчеты,
	|		РасчетыСПокупателямиПоДокументамОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|		РасчетыСПокупателямиПоДокументамОстатки.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|		РасчетыСПокупателямиПоДокументамОстатки.РегламентированныйУчет КАК РегламентированныйУчет,
	|		РасчетыСПокупателямиПоДокументамОстатки.Сделка КАК Сделка,
	|		ВЫБОР
	|			КОГДА РасчетыСПокупателямиПоДокументамОстатки.СуммаОстаток > 0
	|				ТОГДА РасчетыСПокупателямиПоДокументамОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК УменьшениеДолга,
	|		ВЫБОР
	|			КОГДА РасчетыСПокупателямиПоДокументамОстатки.СуммаОстаток < 0
	|				ТОГДА -РасчетыСПокупателямиПоДокументамОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК УвеличениеДолга
	|	ИЗ
	|		РегистрНакопления.РасчетыСПокупателямиПоДокументам.Остатки(&Момент, Контрагент = &Контрагент) КАК РасчетыСПокупателямиПоДокументамОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		""РасчетыСПоставщиками"",
	|		РасчетыСПоставщикамиПоДокументамОстатки.ДоговорВзаиморасчетов,
	|		РасчетыСПоставщикамиПоДокументамОстатки.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов,
	|		РасчетыСПоставщикамиПоДокументамОстатки.РегламентированныйУчет,
	|		РасчетыСПоставщикамиПоДокументамОстатки.Сделка,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток > 0
	|				ТОГДА РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток < 0
	|				ТОГДА -РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(&Момент, Контрагент = &Контрагент) КАК РасчетыСПоставщикамиПоДокументамОстатки) КАК РЕЗУЛЬТАТ
	|ГДЕ
	|	РЕЗУЛЬТАТ.РегламентированныйУчет = &РегламентированныйУчет";
	
	ТекстЗапроса1 = "ВЫБРАТЬ ДоговорВзаиморасчетов
	|		,ВалютаВзаиморасчетов
	|		,Сделка
	|		,УменьшениеДолга
	|		,УвеличениеДолга
	|ИЗ (
	|	ВЫБРАТЬ
	|		ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	|		,ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|		,ВзаиморасчетыКомпанииОстатки.Сделка КАК Сделка
	|		,ВЫБОР КОГДА ВзаиморасчетыКомпанииОстатки.СуммаОстаток>0 ТОГДА ВзаиморасчетыКомпанииОстатки.СуммаОстаток ИНАЧЕ 0 КОНЕЦ КАК УменьшениеДолга
	|		,ВЫБОР КОГДА ВзаиморасчетыКомпанииОстатки.СуммаОстаток<0 ТОГДА -ВзаиморасчетыКомпанииОстатки.СуммаОстаток ИНАЧЕ 0 КОНЕЦ КАК УвеличениеДолга
	|		,ВЫБОР 
	|			КОГДА ВзаиморасчетыКомпанииОстатки.Сделка ССЫЛКА Документ.Инкассация Тогда
	|				&РегламентированныйУчет
	|			ИНАЧЕ
	|				ВзаиморасчетыКомпанииОстатки.Сделка.РегламентированныйУчет
	|			КОНЕЦ КАК РегламентированныйУчет
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&Момент,Контрагент=&Контрагент) КАК ВзаиморасчетыКомпанииОстатки
	|	) КАК РЕЗУЛЬТАТ
	|ГДЕ
	|	РЕЗУЛЬТАТ.РегламентированныйУчет=&РегламентированныйУчет		
	|";
	
	Если Кнопка = "ЗаполнитьПоОрганизации" Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И ДоговорВзаиморасчетов.Организация = &Организация
		|";
		Запрос.УстановитьПараметр("Организация",Объект.Организация);
	КонецЕсли;
	Если Кнопка = "ЗаполнитьПоДоговору" Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
		|";
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов",Договор);
	КонецЕсли;
	//ТекстЗапроса = ТекстЗапроса + " УПОРЯДОЧИТЬ ПО Сделка АВТОУПОРЯДОЧИВАНИЕ ";
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	Расчеты,
	|	Сделка
	|АВТОУПОРЯДОЧИВАНИЕ";
	МоментВремени=?(Объект.Ссылка.Пустая(),Новый МоментВремени(КонецДня(Объект.Дата)),Объект.Ссылка.МоментВремени());
	
	Запрос.УстановитьПараметр("Момент",МоментВремени);
	Запрос.УстановитьПараметр("Контрагент",Объект.Контрагент);
	Запрос.УстановитьПараметр("РегламентированныйУчет",Объект.РегламентированныйУчет);
	
	Запрос.Текст = ТекстЗапроса;
	Объект.Состав.Очистить();
	Объект.Состав.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//// итоговые суммы
	//СуммаДокументаПриход=0;
	//СуммаДокументаРасход=0;
	//Для Каждого СтрокаТЧ Из Объект.Состав Цикл
	//	СуммаДокументаПриход=СуммаДокументаПриход+ОбщегоНазначенияТК.обПересчет(СтрокаТЧ.УвеличениеДолга,СтрокаТЧ.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов,Объект.Дата,Объект.ВалютаДокумента,Объект.КурсДокумента);
	//	СуммаДокументаРасход=СуммаДокументаРасход+ОбщегоНазначенияТК.обПересчет(СтрокаТЧ.УменьшениеДолга,СтрокаТЧ.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов,Объект.Дата,Объект.ВалютаДокумента,Объект.КурсДокумента);
	//КонецЦикла;
	//Объект.СуммаДокументаПриход=СуммаДокументаПриход;
	//Объект.СуммаДокументаРасход=СуммаДокументаРасход;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапролнитьДолгами(Команда)
	Заполнение(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОрганизации(Команда)
	Заполнение(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДоговору(Команда)
	Перем ВыбранныйДоговор;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыФормы.Вставить("Отбор",Новый Структура("Контрагент,",Объект.Контрагент,));
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПараметрыФормы.Отбор.Вставить("Организация",Объект.Организация);
	КонецЕсли;
	ОповещениЕ = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтотОбъект, Команда.Имя);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы,ВыбранныйДоговор,,,,ОповещениЕ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбора(Договор,Кнопка)		Экспорт
	Заполнение(Кнопка,Договор);
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЗаполнения()
	Элементы.СоставЗапролнитьДолгами.Видимость = ЗначениеЗаполнено(Объект.Контрагент); 
	Элементы.СоставЗаполнитьПоОрганизации.Видимость = ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Организация);
	Элементы.СоставЗаполнитьПоДоговору.Видимость = ЗначениеЗаполнено(Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ВидимостьЗаполнения();
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ВидимостьЗаполнения();
КонецПроцедуры
